<a href="https://colab.research.google.com/github/rvjh/PythonPractice/blob/main/Untitled75.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Write a Python program to get the volume of a sphere with radius 6

In [1]:
def get_vol(r):
  pi = 3.14
  v = (4*pi*r*r*r)/3
  return f"volumn is {v}"

a = int(input("Enter the eadius : "))
get_vol(a)

Enter the eadius : 6

'volumn is 904.32'

Write a Python program to get the difference between a given number and 17, if the number is greater than 17 return double the absolute difference

In [7]:
def get_dif(n):
  if n<=17:
    return (17-n)
  else:
    return 2*(n-17)

a = int(input("Enter the num : "))
get_dif(a)

Enter the num : 20

6

Write a Python program to calculate the sum of three given numbers, if the values are equal then return three times of their sum

In [9]:
a = int(input("Enter the num : "))
b = int(input("Enter the num : "))
c = int(input("Enter the num : "))

def get_su(m,n,o):
  if m==n and n==o and m==o:
    return 3*m
  else:
    return m+n+o

get_su(a,b,c)

Enter the num : 10
Enter the num : 10
Enter the num : 10

30

Write a Python program to get a new string from a given string where "Is" has been added to the front. If the given string already begins with "Is" then return the string unchanged.

In [14]:
def new_string(str):
  if len(str) >= 2 and str[:2] == "Is":
    return str
  return "Is" + str

print(new_string("Array"))
print(new_string("IsEmpty"))

IsArray
IsEmpty

 Write a Python program to get a string which is n (non-negative integer) copies of a given string.

In [15]:
def get_st(st,n):
  if n!=0:
    return st*n

get_st("abc",2)

'abcabc'

Write a Python program to remove the characters which have odd index values of a given string

In [21]:
def get_string(st):
  r = ""
  for i in range(len(st)):
    if i%2==0:
      r=r+st[i]
  return r

get_string("rohan")

'rhn'

Write a Python program to count the occurrences of each word in a given sentence

In [29]:
def word_count(st):
  c = dict()
  w = st.split()

  for word in w:
    if word in c:
      c[word]+=1
    else:
      c[word]=1
  return c


word_count("a bad girl is always a bad boy")

{'a': 2, 'always': 1, 'bad': 2, 'boy': 1, 'girl': 1, 'is': 1}

Write a Python script that takes input from the user and displays that input back in upper and lower cases

In [33]:
a = input("Enter string : ")
a

print(f"Upper {a.upper()}")
print(f"Upper {a.lower()}")
print(f"Upper {a.title()}")

Enter string : rOhAN
Upper ROHAN
Upper rohan
Upper Rohan

In [37]:
a = ['a','b','c']
b = [1,2,3]

c= dict(zip(a,b))
print(c)

import pandas as pd
d = pd.DataFrame({
    'a':a,
    'b':b},columns=['a','b'])
d

{'a': 1, 'b': 2, 'c': 3}

   a  b
0  a  1
1  b  2
2  c  3

Write a Python program access the index of a list.

In [43]:
b = [1,2,3]

for i in range(len(b)):
  print(f"{i} : value : {b[i]}")

0 : value : 1
1 : value : 2
2 : value : 3

Write a Python program to convert a list of characters into a string

In [45]:
a = ['a','b','c']
b=''.join(a)
b

'abc'

Write a Python program to find the index of an item in a specified list

In [49]:
a = ['abc','def','ghi']

b = input("Enter : ")

if b in a:
  print(f"{b} has index {a.index(b)}")

Enter : ghi
ghi has index 2

Write a Python script to concatenate following dictionaries to create a new one. Go to the editor

Sample Dictionary :
dic1={1:10, 2:20}
dic2={3:30, 4:40}
dic3={5:50,6:60}
Expected Result : {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}

In [54]:
dic1={1:10, 2:20}
dic2={3:30, 4:40}
dic3={5:50,6:60}

dic4 = {}

for d in (dic1,dic2,dic3):
  dic4.update(d)

dic4

{1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}

In [62]:
a = {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}

b = int(input("Enter key : "))

if b in a:
  print("True")
else:
  print("False")

Enter key : 3
True

Write a Python program to iterate over dictionaries using for loops

In [64]:
a = {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}

for i,j in a.items():
  print(f"key {i} and value : {j}")

key 1 and value : 10
key 2 and value : 20
key 3 and value : 30
key 4 and value : 40
key 5 and value : 50
key 6 and value : 60

Write a Python script to generate and print a dictionary that contains a number (between 1 and n) in the form (x, x*x). Go to the editor
Sample Dictionary ( n = 5) :
Expected Output : {1: 1, 2: 4, 3: 9, 4: 16, 5: 25}

In [66]:
def gen(n):
  d={}
  for i in range(1,n+1):
    d[i]=i*i
  return d

gen(10)

{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100}

In [67]:
def gen1(n):
  d={}
  for i in range(1,n+1):
    d[i]=i*i
  return d

gen1(16)

{1: 1,
 2: 4,
 3: 9,
 4: 16,
 5: 25,
 6: 36,
 7: 49,
 8: 64,
 9: 81,
 10: 100,
 11: 121,
 12: 144,
 13: 169,
 14: 196,
 15: 225,
 16: 256}

In [70]:
dic1={1:10, 2:20}
dic2={3:30, 4:40}

d = {}

for i in (dic1,dic2):
  d.update(i)
d

{1: 10, 2: 20, 3: 30, 4: 40}

Write a Python program to sum all the items in a dictionary

In [76]:
dic1={1:10, 2:20}

sum(list(dic1.values()))

30

Write a Python program to multiply all the items in a dictionary

In [79]:
dic1={1:10, 2:20}
b=[]
for i,j in dic1.items():
  b.append(j)

m=1
for i in b:
  m=m*i

m

200

Write a Python program to remove a key from a dictionary

In [81]:
dic1={1:10, 2:20}
dic1.pop(2)

20

Write a Python program to map two lists into a dictionary.

In [83]:
keys = ['red', 'green', 'blue']
values = ['#FF0000','#008000', '#0000FF']

c = dict(zip(keys,values))
c

{'blue': '#0000FF', 'green': '#008000', 'red': '#FF0000'}

Write a Python program to sort a given dictionary by key

In [91]:
color_dict = {'red':'#FF0000',
          'green':'#008000',
          'black':'#000000',
          'white':'#FFFFFF'}
for i in sorted(color_dict):
  print(f"key {i} values : {color_dict[i]}")

key black values : #000000
key green values : #008000
key red values : #FF0000
key white values : #FFFFFF

Write a Python program to get the maximum and minimum value in a dictionary

In [95]:
my_dict = {'x':500, 'y':5874, 'z': 560}

maxval = max(list(my_dict.values()))
minval = min(list(my_dict.values()))
print(f"max {maxval} min {minval}")

max 5874 min 500

In [98]:
import numpy as np

print(np.__version__)
print(np.__config__)

1.19.5
<module 'numpy.__config__' from '/usr/local/lib/python3.7/dist-packages/numpy/__config__.py'>

Write a NumPy program to create an array of 10 zeros,10 ones, 10 fives

In [101]:
a = np.zeros(10)
print(a)
b=np.ones(10)
print(b)
c=np.ones(10)
print(c*5)

[0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
[1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
[5. 5. 5. 5. 5. 5. 5. 5. 5. 5.]

In [102]:
#10*10 with 9 inside

a = np.ones((10,10))
print(a*9)

[[9. 9. 9. 9. 9. 9. 9. 9. 9. 9.]
 [9. 9. 9. 9. 9. 9. 9. 9. 9. 9.]
 [9. 9. 9. 9. 9. 9. 9. 9. 9. 9.]
 [9. 9. 9. 9. 9. 9. 9. 9. 9. 9.]
 [9. 9. 9. 9. 9. 9. 9. 9. 9. 9.]
 [9. 9. 9. 9. 9. 9. 9. 9. 9. 9.]
 [9. 9. 9. 9. 9. 9. 9. 9. 9. 9.]
 [9. 9. 9. 9. 9. 9. 9. 9. 9. 9.]
 [9. 9. 9. 9. 9. 9. 9. 9. 9. 9.]
 [9. 9. 9. 9. 9. 9. 9. 9. 9. 9.]]

Write a NumPy program to create an array of the integers from 30 to 70.

In [104]:
a=np.arange(30,71)
a

array([30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46,
       47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63,
       64, 65, 66, 67, 68, 69, 70])

Write a NumPy program to create an array of all the even integers from 30 to 70

In [107]:
np.arange(30,71,2)

array([30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62,
       64, 66, 68, 70])

Write a NumPy program to create a 3x3 identity matrix.

In [108]:
a=np.ones((3,3))
a

array([[1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.]])

 Write a NumPy program to create a 3x3 identity matrix, i.e. diagonal elements are 1, the rest are 0

In [115]:
a=np.eye(3)
a

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [116]:
a = np.diag([1,2,3,4,5])
a

array([[1, 0, 0, 0, 0],
       [0, 2, 0, 0, 0],
       [0, 0, 3, 0, 0],
       [0, 0, 0, 4, 0],
       [0, 0, 0, 0, 5]])

Write a Pandas program to get the powers of an array values element-wise

{'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

In [117]:
import pandas as pd
pd.DataFrame({
    'X':[78,85,96,80,86],
    'Y':[84,94,89,83,86],
    'Z':[86,97,96,72,83]},columns=['X','Y','Z'])

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

Sample DataFrame:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [120]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

a = pd.DataFrame(exam_data,columns=['name','score','attempts','qualify'])
a['labels'] = labels
a

        name  score  attempts qualify labels
0  Anastasia   12.5         1     yes      a
1       Dima    9.0         3      no      b
2  Katherine   16.5         2     yes      c
3      James    NaN         3      no      d
4      Emily    9.0         2      no      e
5    Michael   20.0         3     yes      f
6    Matthew   14.5         1     yes      g
7      Laura    NaN         1      no      h
8      Kevin    8.0         2      no      i
9      Jonas   19.0         1     yes      j

In [123]:
a.describe().T

          count     mean       std  min  25%   50%     75%   max
score       8.0  13.5625  4.693746  8.0  9.0  13.5  17.125  20.0
attempts   10.0   1.9000  0.875595  1.0  1.0   2.0   2.750   3.0

In [124]:
a[:3]

        name  score  attempts qualify labels
0  Anastasia   12.5         1     yes      a
1       Dima    9.0         3      no      b
2  Katherine   16.5         2     yes      c

In [126]:
a[['name','score']]

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5
3      James    NaN
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
7      Laura    NaN
8      Kevin    8.0
9      Jonas   19.0

In [127]:
a

        name  score  attempts qualify labels
0  Anastasia   12.5         1     yes      a
1       Dima    9.0         3      no      b
2  Katherine   16.5         2     yes      c
3      James    NaN         3      no      d
4      Emily    9.0         2      no      e
5    Michael   20.0         3     yes      f
6    Matthew   14.5         1     yes      g
7      Laura    NaN         1      no      h
8      Kevin    8.0         2      no      i
9      Jonas   19.0         1     yes      j

In [133]:
#    NaN	3
#    9.0	2

## specified location
a.iloc[[3,4],[1,2]]

   score  attempts
3    NaN         3
4    9.0         2

Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [134]:
a

        name  score  attempts qualify labels
0  Anastasia   12.5         1     yes      a
1       Dima    9.0         3      no      b
2  Katherine   16.5         2     yes      c
3      James    NaN         3      no      d
4      Emily    9.0         2      no      e
5    Michael   20.0         3     yes      f
6    Matthew   14.5         1     yes      g
7      Laura    NaN         1      no      h
8      Kevin    8.0         2      no      i
9      Jonas   19.0         1     yes      j

In [141]:
import numpy as np
for i in np.where(a['attempts']>2):
  print(a.iloc[i])

      name  score  attempts qualify labels
1     Dima    9.0         3      no      b
3    James    NaN         3      no      d
5  Michael   20.0         3     yes      f

In [143]:
a[a['attempts']>2]

      name  score  attempts qualify labels
1     Dima    9.0         3      no      b
3    James    NaN         3      no      d
5  Michael   20.0         3     yes      f

In [145]:
row, col = a.shape
print(row,col)

10 5

Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [148]:
a[a['score'].isna()]

    name  score  attempts qualify labels
3  James    NaN         3      no      d
7  Laura    NaN         1      no      h

Write a Pandas program to select the rows the score is between 15 and 20 (inclusive)

In [157]:
a[a['score'].between(15,20)]

        name  score  attempts qualify labels
2  Katherine   16.5         2     yes      c
5    Michael   20.0         3     yes      f
9      Jonas   19.0         1     yes      j

Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15

In [164]:
a[(a['attempts']<2) & (a['score']>15)]

    name  score  attempts qualify labels
9  Jonas   19.0         1     yes      j

Write a Pandas program to change the score in row 'd' to 11.5.

In [191]:
a